import java.util.Scanner;

public class Lab12 {

//    คำอธิบาย
//    พีระมิดเป็นหนึ่งในสิ่งมหัศจรรย์ของโลก ที่มีผู้คนพูดถึงมากมายเกี่ยวกับการก่อสร้างมัน บางคนก็ว่าอาจเกิดจากเทพเจ้าหรือมนุษย์ต่างดาว
//    แม้ว่าหลักฐานที่เราเห็นแน่ชัดแล้วว่าจะมาจากคนธรรมดาที่มีความเชื่อที่จะส่งกษัตริย์แห่งอียิปต์ที่เขารักและเชิดชูกลับสวรรค์ก็ตาม
//    โจทย์ในวันนี้คือให้เราพัฒนาโปรแกรมเพื่อสร้างพีระมิดโดยให้ผู้ใช้งานกรอกตัวเลขเข้ามาในระบบเพื่อสร้างพีระมิดตามจำนวนชั้นที่ได้กำหนดไว้
//    ให้เราพัฒนาโปรแกรมดังกล่าว โดยดูตัวอย่างได้จากกรณีทดสอบด้านล่าง

    // Input : 5
//    // Output :
//                  *
//                 ***
//                *****
//               *******
//              *********

    public static void main(String[] args) {

        Scanner sc = new Scanner(System.in);

        int row = sc.nextInt();
        int space = row;
        int temp = 0;

        for (int i = 1; i <= row; i++) {

            for (int j = 1; j < space; j++) {
                System.out.print(" ");
            }

            for (int k = 0; k < i; k++) {
                System.out.print("*");
            }

            for (int h = 0; h < temp; h++) {
                System.out.print("*");
            }

            temp++;
            space--;
            System.out.println();

        }

    }

}
