import java.util.Scanner;

public class Lab10 {

//    คำอธิบาย
//    เรื่องเล่าจากโจทย์
//    เรื่องราวของวิชาฟิสิกส์ที่เรามักเจอกันในบทเรียนแรกๆ คือสูตร v=s/t
//    ซึ่งคือสูตรในการคำนวณหาระยะทางที่เคลื่อนที่ได้ ต่อ 1 หน่วยเวลา
//    v คืออัตราเร็วของการเคลื่อนที่ (m/s หรือ km/hr)
//    t คือเวลาที่วัตถุใช้เคลื่อนที่จริง (s หรือ hr)
//    เช่น ถ้าหากเราต้องการจะทราบว่ารถคันหนึ่งอัตราเร็วเท่าไหร่ เราก็นำระทางที่รถคันนั้นเคลื่อนที่ได้ (ซึ่งหน่วยอาจจะเป็นเมตร หรือ กิโลเมตรก็แล้วแต่)
//    นำมาหารกับ เวลาที่เคลื่อนที่นั้นเอง เหมือนที่เราพบเห็นบ่อยๆ ที่เขามักพูดกันว่า 100 กิโลเมตรต่อชั่วโมง หรือ 120 กิโลเมตรต่อชั่วโมงทำนองนั้นเลย ! ให้เราพัฒนาโปรแกรมคำนวณหาค่าอัตราเร็ว โดยให้ผู้ใช้งาน
//    กรอกระยะทาง โดยมีค่าตั้งแต่ 1 ขึ้นไป (หน่วยเป็นกิโลเมตร แต่ไม่ต้องกรอกหน่วยนะ!)
//    กรอกเวลาที่เคลื่อนที่ โดยมีค่าตั้งแต่ 1 ขึ้นไป (หน่วยเป็นชั่วโมง แต่ไม่ต้องกรอกหน่วยนะ!)
//    พร้อมทั้งแสดงผลลัพธ์ออกมาบนหน้าจอตามตัวอย่างกรณีทดสอบด้านล่าง

    public static void main(String[] args) {

        Scanner sc = new Scanner(System.in);

        int s = sc.nextInt();
        int t = sc.nextInt();

        System.out.println(s/t + " km/h");

    }

}
