public class Lab05 {

//    คำอธิบาย
//    เรื่องเล่าผ่านโจทย์
//    ลุงสมหมายได้เปิดร้านของชำเป็นของตัวเอง ด้วยความที่เขามีคอมพิวเตอร์อยู่หนึ่งตัวตั้งทิ้งไว้ เขาจึงคิดว่า คงจะดีมากๆถ้าหน้าจอนั้นมีข้อความแสดงเพื่อต้อนรับลูกค้าของเขา
//    เวลาเดินเข้าร้านจะได้เห็นข้อความต้อนรับนี้ผ่านทางหน้าจอ ดังนั้นแล้วเขาจึงถามคนที่เขารู้จักว่ามีใครบ้างที่สามารถทำโปรแกรมแบบนี้ให้เขาได้
//    จึงได้มารู้จักเรา และขอให้ทำโปรแกรมที่แสดงข้อความต้อนรับลูกค้าให้เขาหน่อย
//    (ไม่มีการรับ input และสำหรับข้อความที่ให้แสดงผล ดูได้จากตารางด้านล่าง)

    public static void main(String[] args) {

        System.out.println("Welcome to Sommai 108 Eleven Shop");

    }

}
