public class Lab08 {

//    คำอธิบาย
//    เรื่องเล่าจากโจทย์
//    ต่อมาหลังจากรู้ได้ว่าเราสามารถทำโปรแกรมได้ เด็กหญิงสมจริงดีใจสุด ๆ
//    พร้อมทั้งอยากให้เราทำอีกรูปหนึ่งซึ่งเด็กน้อยคนนี้สนใจไม่แพ้กันนั่นก็คือ "พีระมิด"
//    เนื่องจากลุงสมหมายชอบเปิดวีดีโอสารคดีให้ดูบ่อยๆ ดังนั้นถึงแม้ว่าเราจะไม่อยากทำก็ตาม
//    แต่สายตาของเด็กน้อยที่จ้องมาที่เรา ก็จะต้องทำให้เรายอมสร้างโปรแกรมขึ้นมาอีกตัวหนึ่งเพื่อให้เด็กหญิงคนนี้นั่นเอง
//    (ข้อนี้ไม่มีการรับ input)

//        $
//       $ $
//      $ $ $
//     $ $ $ $
//    $ $ $ $ $

    public static void main(String[] args) {

        int row = 5;

        for (int i = 1; i <= 5; i++) {

            for (int space = 1; space < row; space++) {
                System.out.print(" ");
            }

            for (int j = 0; j < i; j++) {
                System.out.print("$ ");
            }

            row--;
            System.out.println();

        }

    }
}
