import java.util.Scanner;

public class Lab11 {

//    คำอธิบาย
//    เรื่องเล่าจากโจทย์
//    บันไดเป็นสิ่งที่เราพบเห็นได้ในชีวิตประจำวัน และ เป็นโจทย์ที่เราก็เคยทำกันไปแล้วทั้งนั้น ? เนื่องจากว่าเรานั้นได้ไปรับงานจากบริษัท
//    ชื่อดังเรื่องการออกแบบรวมถึงรับเหมาก่อสร้างบ้าน ที่เขามักจะให้ลูกค้าของเขานั้น สามารถใส่จำนวนขั้นบันไดได้เอง แล้วโปรแกรมจะทำการ
//    แสดงหน้าตาของบันไดที่ผู้ใช้งานได้กรอกตัวเลขลงไป (ที่เป็นจำนวนขั้น) และแสดงออกมาผ่านทางหน้าจอ ให้เราพัฒนาโปรแกรมดังกล่าว โดยดูตัวอย่างได้จากกรณีทดสอบด้านล่าง

    public static void main(String[] args) {

        Scanner sc = new Scanner(System.in);

        int a = sc.nextInt();

        for (int i = 1; i <= a; i++) {

            for (int j = 0; j < i; j++) {
                System.out.print("*");
            }

            System.out.println();

        }

    }

}
