age=int(input("ป้อนอายุของคุณ :"))
if age>=15 and age <=20:
    print("วัยรุ่น")
elif age>=20 and age<=29:
    print("วัยหนุ่มสาว")
elif age>=30 and age<=39:
    print("วัยผู้ใหญ่")
elif age>=80:
    print("วัยชรา")
else :
    print("วัยเด็ก")

print("จบโปรแกรม")

# ------------------------------------------------------------

age=int(input("ป้อนอายุของคุณ :"))
# Ternary Operator
# คำสั่งเมื่อเงื่อนเป็นจริง if เงื่อนไข else คำสั่งเมื่อเงื่อนเป็นเท็จ
print("วัยรุ่น") if age>=15 else print("วัยเด็ก")

print("จบโปรแกรม")

# ------------------------------------------------------------