public class Compound_Assignment {
    public static void main(String[] args) {

        /*
            เป็นการทำตัว Operator มาใช้งานร่วมกับเครื่องหมาย =
            ช่วยทำให้การเขียนสั้นกว่าเดิม

            เช่น x+=y คือ x=x+y

            เครื่องหมายต่าง ๆ มีดังนี้
             += ความหมายคือ x+=y คือ x=x+y
             -= ความหมายคือ x-=y คือ x=x-y
             *= ความหมายคือ x*=y คือ x=x*y
             /= ความหมายคือ x/=y คือ x=x/y
             %= ความหมายคือ x%=y คือ x=x%y

         */

        //EX01
        int num1 = 10, num2 = 5;

        // เป็นการใช้เครื่องหมาย += มาช่วยในการเขียน แทนที่จะเป็น num1 = num1 + num2 สามารถช่วยลดเวลาในการเขียนได้มากขึ้น
        // สามารถเปลี่ยนแปลงเครื่องหมายในการใช้งานได้ตามต้องการเช่น num1*=num2, num1/=num2
        num1 += num2;
        System.out.println(num1);
    }
}
